<?php

namespace Database\Seeders;

use App\Models\Curriculum;
use App\Models\Group;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProjectSeed extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        $groups = Group::all();
        $currs = Curriculum::all();

        DB::table('projects')->insert([
            'name_th' => 'การพัฒนาระบบสารสนเทศเพื่อสืบค้นโครงงานผ่านเว็บแอปพลิเคชัน กรณีศึกษา สาขาวิชาสถิติ คณะวิทยาศาสตร์ มหาวิทยาลัยขอนแก่น',
            'name_en' => 'Development the Information System for Project Searching on Web Application Case Study: Department of Statistics, Faculty of Science, Khon Kaen University',
            'abstract' => 'การค้นคว้าวิจัยครั้งนี้มีวัตถุประสงค์ เพื่อศึกษาแนวคิดการพัฒนาหลักสูตรท้องถิ่นภาษาล้านนา ด้านการจัดการเรียนการสอนและแนวคิดการอนุรักษ์และสืบทอดภาษาล้านนาของสถานศึกษาในจังหวัดน่าน ประกอบด้วยวัด โรงเรียน โรงเรียนพระปริยัติธรรมกลุ่มผู้ให้ข้อมูลหลักที่ให้สัมภาษณ์ประกอบด้วยครูผู้สอนภาษาล้านนา 11 คน ในเรื่อง หลักสูตร วิธีสอน สื่อ-อุปกรณ์การสอน การวัดผลและการประเมินผล และหน่วยงาน องค์กร ผู้มีส่วนส่งเสริมสนับสนุนให้มีการอนุรักษ์สืบทอดภูมิปัญญาท้องถิ่นภาษาล้านนาในจังหวัดน่าน จำนวน 11 คน ในเรื่อง การอนุรักษ์และสืบทอดภาษาล้านนา การนำความรู้ภาษาล้านนาไปประยุกต์ใช้ให้เกิดประโยชน์ ของกลุ่มตัวอย่างที่ตอบแบบสอบถาม ประกอบด้วยผู้เรียนภาษาล้านนา จำนวน 328 รูป/คน ในเรื่อง หลักสูตร วิธีสอน สื่อ-อุปกรณ์การสอน การวัดผลและประเมินผล ผู้ทรงคุณวุฒิที่นำความรู้ภาษาล้านนาทั้งด้านการอ่านและการเขียน มาใช้ประโยชน์ จำนวน 4 คน ในด้านวิชาการ ด้านประเพณีพิธีกรรมความเชื่อ ด้านแพทย์แผนไทยตำรายา และด้านวิชาการ เครื่องมือที่ใช้ในการรวบรวมข้อมูลเป็นแบบสัมภาษณ์และแบบสอบถาม การวิเคราะห์ข้อมูลจากการสัมภาษณ์ ใช้การวิเคราะห์ สรุป และบรรยาย ส่วนข้อมูลแบบสอบถามเพื่อใช้ประกอบการวิจัยครั้งนี้ใช้ค่าร้อยละ ส่วนคำถามที่เป็นปลายเปิด นำมาเขียนบรรยายสรุปเป็นรายงานการวิจัยตามวัตถุประสงค์ ผลการวิจัยพบว่า การจัดการเรียนการสอนภาษาล้านนาเกี่ยวกับหลักสูตร วิธีสอน สื่อ-อุปกรณ์การสอน การวัดผลและการประเมินผลของสถานศึกษาในจังหวัดน่าน มีหลักสูตรที่ใช้ 2 อย่าง ได้แก่ หลักสูตรท้องถิ่น ของเขตการศึกษา 8 และหลักสูตรที่พัฒนาขึ้นเอง เพื่อให้เหมาะสมกับการจัดการเรียนการสอนตามอัธยาศัย จึงทำให้หลักสูตรไม่เป็นมาตรฐานเดียวกัน การจัดการเรียนการสอนจึงแตกต่างกันไป ขึ้นอยู่กับแผนงานและนโยบายของฝ่ายวิชาการแต่ละสถานศึกษาและความรู้ ความชำนาญของครูผู้สอนภาษาล้านนา วิธีการสอน ส่วนใหญ่เน้นการสอนแบบบรรยายให้ผู้เรียนจดจำการอ่านและการเขียนจากครูผู้สอน ขาดกระบวนการสอนที่หลากหลาย ไม่เน้นผู้เรียนเป็นสำคัญ สื่อ-อุปกรณ์การสอน ใช้ตำราเรียนหรือแบบเรียนภาษาล้านนา ใช้แผ่นใส ขาดความทันสมัยไม่น่าสนใจ ไม่ได้นำโปรแกรมช่วยสอนภาษาล้านนา (CAI : Computer Assisted Instruction) และ Web site ในคอมพิวเตอร์มาใช้ การวัดผลประเมินผล ส่วนใหญ่มีการตั้งเกณฑ์และให้เป็นเกรดระดับคะแนน โดยอิงเกณฑ์วัดผลประเมินผลของสถานศึกษา ส่วนใหญ่ยังไม่วัดผลประเมินผลตามสภาพจริงเพื่อให้ทราบถึงพัฒนาการของผู้เรียน แต่จะทดสอบเน้นความจำเพียงด้านเดียว การนำความรู้ภาษาล้านนามาใช้ประโยชน์ ในด้านศาสนาส่วนใหญ่จะใช้ในการเทศน์ อบรม สั่งสอน หรือแสดงพระธรรมเทศนาธรรมชาดกต่างๆ เป็นทำนองพื้นเมือง ด้านพิธีกรรม จะใช้ในพิธีสืบชะตา พิธีสู่ขวัญ พิธีสงเคราะห์ ด้านแพทย์แผนไทยตำรายา จะนำมาใช้ในการปรุงยารักษาโรคต่างๆ ด้านวิชาการ ส่วนมากแล้วจะเป็นผลงานด้านปริวรรตหรือแปลภาษาล้านนาเป็นภาษาไทยกลาง เช่น วรรณกรรมเกี่ยวกับพุทธศาสนา วรรณกรรมคำสอน พิธีกรรมความเชื่อ ผลิตตำราเรียน ตำรายา',
            'year' => '2021',
            'advisor_joint' => 'นายอนุชิต คังดงเค็ง, นางสาวธัญจิรา ยางเดี่ยว',
            'group_id' => $groups[3]->id,
            'curricula_id' => $currs[1]->id,
        ]);
    }
}
